GopalSaraf/Practicals/PSDL/include/proc/pic16lf19186.inc
// Register: RF3PPS
#define RF3PPS RF3PPS
RF3PPS                                   equ 01E3Bh
// bitfield definitions
RF3PPS_RF3PPS0_POSN                      equ 0000h
RF3PPS_RF3PPS0_POSITION                  equ 0000h
RF3PPS_RF3PPS0_SIZE                      equ 0001h
RF3PPS_RF3PPS0_LENGTH                    equ 0001h
RF3PPS_RF3PPS0_MASK                      equ 0001h
RF3PPS_RF3PPS1_POSN                      equ 0001h
RF3PPS_RF3PPS1_POSITION                  equ 0001h
RF3PPS_RF3PPS1_SIZE                      equ 0001h
RF3PPS_RF3PPS1_LENGTH                    equ 0001h
RF3PPS_RF3PPS1_MASK                      equ 0002h
RF3PPS_RF3PPS2_POSN                      equ 0002h
RF3PPS_RF3PPS2_POSITION                  equ 0002h
RF3PPS_RF3PPS2_SIZE                      equ 0001h
RF3PPS_RF3PPS2_LENGTH                    equ 0001h
RF3PPS_RF3PPS2_MASK                      equ 0004h
RF3PPS_RF3PPS3_POSN                      equ 0003h
RF3PPS_RF3PPS3_POSITION                  equ 0003h
RF3PPS_RF3PPS3_SIZE                      equ 0001h
RF3PPS_RF3PPS3_LENGTH                    equ 0001h
RF3PPS_RF3PPS3_MASK                      equ 0008h
RF3PPS_RF3PPS4_POSN                      equ 0004h
RF3PPS_RF3PPS4_POSITION                  equ 0004h
RF3PPS_RF3PPS4_SIZE                      equ 0001h
RF3PPS_RF3PPS4_LENGTH                    equ 0001h
RF3PPS_RF3PPS4_MASK                      equ 0010h
RF3PPS_RF3PPS5_POSN                      equ 0005h
RF3PPS_RF3PPS5_POSITION                  equ 0005h
RF3PPS_RF3PPS5_SIZE                      equ 0001h
RF3PPS_RF3PPS5_LENGTH                    equ 0001h
RF3PPS_RF3PPS5_MASK                      equ 0020h

// Register: RF4PPS
#define RF4PPS RF4PPS
RF4PPS                                   equ 01E3Ch
// bitfield definitions
RF4PPS_RF4PPS0_POSN                      equ 0000h
RF4PPS_RF4PPS0_POSITION                  equ 0000h
RF4PPS_RF4PPS0_SIZE                      equ 0001h
RF4PPS_RF4PPS0_LENGTH                    equ 0001h
RF4PPS_RF4PPS0_MASK                      equ 0001h
RF4PPS_RF4PPS1_POSN                      equ 0001h
RF4PPS_RF4PPS1_POSITION                  equ 0001h
RF4PPS_RF4PPS1_SIZE                      equ 0001h
RF4PPS_RF4PPS1_LENGTH                    equ 0001h
RF4PPS_RF4PPS1_MASK                      equ 0002h
RF4PPS_RF4PPS2_POSN                      equ 0002h
RF4PPS_RF4PPS2_POSITION                  equ 0002h
RF4PPS_RF4PPS2_SIZE                      equ 0001h
RF4PPS_RF4PPS2_LENGTH                    equ 0001h
RF4PPS_RF4PPS2_MASK                      equ 0004h
RF4PPS_RF4PPS3_POSN                      equ 0003h
RF4PPS_RF4PPS3_POSITION                  equ 0003h
RF4PPS_RF4PPS3_SIZE                      equ 0001h
RF4PPS_RF4PPS3_LENGTH                    equ 0001h
RF4PPS_RF4PPS3_MASK                      equ 0008h
RF4PPS_RF4PPS4_POSN                      equ 0004h
RF4PPS_RF4PPS4_POSITION                  equ 0004h
RF4PPS_RF4PPS4_SIZE                      equ 0001h
RF4PPS_RF4PPS4_LENGTH                    equ 0001h
RF4PPS_RF4PPS4_MASK                      equ 0010h
RF4PPS_RF4PPS5_POSN                      equ 0005h
RF4PPS_RF4PPS5_POSITION                  equ 0005h
RF4PPS_RF4PPS5_SIZE                      equ 0001h
RF4PPS_RF4PPS5_LENGTH                    equ 0001h
RF4PPS_RF4PPS5_MASK                      equ 0020h

// Register: RF5PPS
#define RF5PPS RF5PPS
RF5PPS                                   equ 01E3Dh
// bitfield definitions
RF5PPS_RF5PPS0_POSN                      equ 0000h
RF5PPS_RF5PPS0_POSITION                  equ 0000h
RF5PPS_RF5PPS0_SIZE                      equ 0001h
RF5PPS_RF5PPS0_LENGTH                    equ 0001h
RF5PPS_RF5PPS0_MASK                      equ 0001h
RF5PPS_RF5PPS1_POSN                      equ 0001h
RF5PPS_RF5PPS1_POSITION                  equ 0001h
RF5PPS_RF5PPS1_SIZE                      equ 0001h
RF5PPS_RF5PPS1_LENGTH                    equ 0001h
RF5PPS_RF5PPS1_MASK                      equ 0002h
RF5PPS_RF5PPS2_POSN                      equ 0002h
RF5PPS_RF5PPS2_POSITION                  equ 0002h
RF5PPS_RF5PPS2_SIZE                      equ 0001h
RF5PPS_RF5PPS2_LENGTH                    equ 0001h
RF5PPS_RF5PPS2_MASK                      equ 0004h
RF5PPS_RF5PPS3_POSN                      equ 0003h
RF5PPS_RF5PPS3_POSITION                  equ 0003h
RF5PPS_RF5PPS3_SIZE                      equ 0001h
RF5PPS_RF5PPS3_LENGTH                    equ 0001h
RF5PPS_RF5PPS3_MASK                      equ 0008h
RF5PPS_RF5PPS4_POSN                      equ 0004h
RF5PPS_RF5PPS4_POSITION                  equ 0004h
RF5PPS_RF5PPS4_SIZE                      equ 0001h
RF5PPS_RF5PPS4_LENGTH                    equ 0001h
RF5PPS_RF5PPS4_MASK                      equ 0010h
RF5PPS_RF5PPS5_POSN                      equ 0005h
RF5PPS_RF5PPS5_POSITION                  equ 0005h
RF5PPS_RF5PPS5_SIZE                      equ 0001h
RF5PPS_RF5PPS5_LENGTH                    equ 0001h
RF5PPS_RF5PPS5_MASK                      equ 0020h

// Register: RF6PPS
#define RF6PPS RF6PPS
RF6PPS                                   equ 01E3Eh
// bitfield definitions
RF6PPS_RF6PPS0_POSN                      equ 0000h
RF6PPS_RF6PPS0_POSITION                  equ 0000h
RF6PPS_RF6PPS0_SIZE                      equ 0001h
RF6PPS_RF6PPS0_LENGTH                    equ 0001h
RF6PPS_RF6PPS0_MASK                      equ 0001h
RF6PPS_RF6PPS1_POSN                      equ 0001h
RF6PPS_RF6PPS1_POSITION                  equ 0001h
RF6PPS_RF6PPS1_SIZE                      equ 0001h
RF6PPS_RF6PPS1_LENGTH                    equ 0001h
RF6PPS_RF6PPS1_MASK                      equ 0002h
RF6PPS_RF6PPS2_POSN                      equ 0002h
RF6PPS_RF6PPS2_POSITION                  equ 0002h
RF6PPS_RF6PPS2_SIZE                      equ 0001h
RF6PPS_RF6PPS2_LENGTH                    equ 0001h
RF6PPS_RF6PPS2_MASK                      equ 0004h
RF6PPS_RF6PPS3_POSN                      equ 0003h
RF6PPS_RF6PPS3_POSITION                  equ 0003h
RF6PPS_RF6PPS3_SIZE                      equ 0001h
RF6PPS_RF6PPS3_LENGTH                    equ 0001h
RF6PPS_RF6PPS3_MASK                      equ 0008h
RF6PPS_RF6PPS4_POSN                      equ 0004h
RF6PPS_RF6PPS4_POSITION                  equ 0004h
RF6PPS_RF6PPS4_SIZE                      equ 0001h
RF6PPS_RF6PPS4_LENGTH                    equ 0001h
RF6PPS_RF6PPS4_MASK                      equ 0010h
RF6PPS_RF6PPS5_POSN                      equ 0005h
RF6PPS_RF6PPS5_POSITION                  equ 0005h
RF6PPS_RF6PPS5_SIZE                      equ 0001h
RF6PPS_RF6PPS5_LENGTH                    equ 0001h
RF6PPS_RF6PPS5_MASK                      equ 0020h

// Register: RF7PPS
#define RF7PPS RF7PPS
RF7PPS                                   equ 01E3Fh
// bitfield definitions
RF7PPS_RF7PPS0_POSN                      equ 0000h
RF7PPS_RF7PPS0_POSITION                  equ 0000h
RF7PPS_RF7PPS0_SIZE                      equ 0001h
RF7PPS_RF7PPS0_LENGTH                    equ 0001h
RF7PPS_RF7PPS0_MASK                      equ 0001h
RF7PPS_RF7PPS1_POSN                      equ 0001h
RF7PPS_RF7PPS1_POSITION                  equ 0001h
RF7PPS_RF7PPS1_SIZE                      equ 0001h
RF7PPS_RF7PPS1_LENGTH                    equ 0001h
RF7PPS_RF7PPS1_MASK                      equ 0002h
RF7PPS_RF7PPS2_POSN                      equ 0002h
RF7PPS_RF7PPS2_POSITION                  equ 0002h
RF7PPS_RF7PPS2_SIZE                      equ 0001h
RF7PPS_RF7PPS2_LENGTH                    equ 0001h
RF7PPS_RF7PPS2_MASK                      equ 0004h
RF7PPS_RF7PPS3_POSN                      equ 0003h
RF7PPS_RF7PPS3_POSITION                  equ 0003h
RF7PPS_RF7PPS3_SIZE                      equ 0001h
RF7PPS_RF7PPS3_LENGTH                    equ 0001h
RF7PPS_RF7PPS3_MASK                      equ 0008h
RF7PPS_RF7PPS4_POSN                      equ 0004h
RF7PPS_RF7PPS4_POSITION                  equ 0004h
RF7PPS_RF7PPS4_SIZE                      equ 0001h
RF7PPS_RF7PPS4_LENGTH                    equ 0001h
RF7PPS_RF7PPS4_MASK                      equ 0010h
RF7PPS_RF7PPS5_POSN                      equ 0005h
RF7PPS_RF7PPS5_POSITION                  equ 0005h
RF7PPS_RF7PPS5_SIZE                      equ 0001h
RF7PPS_RF7PPS5_LENGTH                    equ 0001h
RF7PPS_RF7PPS5_MASK                      equ 0020h

// Register: ANSELF
#define ANSELF ANSELF
ANSELF                                   equ 01E50h
// bitfield definitions
ANSELF_ANSF0_POSN                        equ 0000h
ANSELF_ANSF0_POSITION                    equ 0000h
ANSELF_ANSF0_SIZE                        equ 0001h
ANSELF_ANSF0_LENGTH                      equ 0001h
ANSELF_ANSF0_MASK                        equ 0001h
ANSELF_ANSF1_POSN                        equ 0001h
ANSELF_ANSF1_POSITION                    equ 0001h
ANSELF_ANSF1_SIZE                        equ 0001h
ANSELF_ANSF1_LENGTH                      equ 0001h
ANSELF_ANSF1_MASK                        equ 0002h
ANSELF_ANSF2_POSN                        equ 0002h
ANSELF_ANSF2_POSITION                    equ 0002h
ANSELF_ANSF2_SIZE                        equ 0001h
ANSELF_ANSF2_LENGTH                      equ 0001h
ANSELF_ANSF2_MASK                        equ 0004h
ANSELF_ANSF3_POSN                        equ 0003h
ANSELF_ANSF3_POSITION                    equ 0003h
ANSELF_ANSF3_SIZE                        equ 0001h
ANSELF_ANSF3_LENGTH                      equ 0001h
ANSELF_ANSF3_MASK                        equ 0008h
ANSELF_ANSF4_POSN                        equ 0004h
ANSELF_ANSF4_POSITION                    equ 0004h
ANSELF_ANSF4_SIZE                        equ 0001h
ANSELF_ANSF4_LENGTH                      equ 0001h
ANSELF_ANSF4_MASK                        equ 0010h
ANSELF_ANSF5_POSN                        equ 0005h
ANSELF_ANSF5_POSITION                    equ 0005h
ANSELF_ANSF5_SIZE                        equ 0001h
ANSELF_ANSF5_LENGTH                      equ 0001h
ANSELF_ANSF5_MASK                        equ 0020h
ANSELF_ANSF6_POSN                        equ 0006h
ANSELF_ANSF6_POSITION                    equ 0006h
ANSELF_ANSF6_SIZE                        equ 0001h
ANSELF_ANSF6_LENGTH                      equ 0001h
ANSELF_ANSF6_MASK                        equ 0040h
ANSELF_ANSF7_POSN                        equ 0007h
ANSELF_ANSF7_POSITION                    equ 0007h
ANSELF_ANSF7_SIZE                        equ 0001h
ANSELF_ANSF7_LENGTH                      equ 0001h
ANSELF_ANSF7_MASK                        equ 0080h

// Register: WPUF
#define WPUF WPUF
WPUF                                     equ 01E51h
// bitfield definitions
WPUF_WPUF0_POSN                          equ 0000h
WPUF_WPUF0_POSITION                      equ 0000h
WPUF_WPUF0_SIZE                          equ 0001h
WPUF_WPUF0_LENGTH                        equ 0001h
WPUF_WPUF0_MASK                          equ 0001h
WPUF_WPUF1_POSN                          equ 0001h
WPUF_WPUF1_POSITION                      equ 0001h
WPUF_WPUF1_SIZE                          equ 0001h
WPUF_WPUF1_LENGTH                        equ 0001h
WPUF_WPUF1_MASK                          equ 0002h
WPUF_WPUF2_POSN                          equ 0002h
WPUF_WPUF2_POSITION                      equ 0002h
WPUF_WPUF2_SIZE                          equ 0001h
WPUF_WPUF2_LENGTH                        equ 0001h
WPUF_WPUF2_MASK                          equ 0004h
WPUF_WPUF3_POSN                          equ 0003h
WPUF_WPUF3_POSITION                      equ 0003h
WPUF_WPUF3_SIZE                          equ 0001h
WPUF_WPUF3_LENGTH                        equ 0001h
WPUF_WPUF3_MASK                          equ 0008h
WPUF_WPUF4_POSN                          equ 0004h
WPUF_WPUF4_POSITION                      equ 0004h
WPUF_WPUF4_SIZE                          equ 0001h
WPUF_WPUF4_LENGTH                        equ 0001h
WPUF_WPUF4_MASK                          equ 0010h
WPUF_WPUF5_POSN                          equ 0005h
WPUF_WPUF5_POSITION                      equ 0005h
WPUF_WPUF5_SIZE                          equ 0001h
WPUF_WPUF5_LENGTH                        equ 0001h
WPUF_WPUF5_MASK                          equ 0020h
WPUF_WPUF6_POSN                          equ 0006h
WPUF_WPUF6_POSITION                      equ 0006h
WPUF_WPUF6_SIZE                          equ 0001h
WPUF_WPUF6_LENGTH                        equ 0001h
WPUF_WPUF6_MASK                          equ 0040h
WPUF_WPUF7_POSN                          equ 0007h
WPUF_WPUF7_POSITION                      equ 0007h
WPUF_WPUF7_SIZE                          equ 0001h
WPUF_WPUF7_LENGTH                        equ 0001h
WPUF_WPUF7_MASK                          equ 0080h

